app/controllers/android_scripts_controller.rb

  def show
  	@android_script = AndroidScript.find(params[:id])
---
SELECT "android_scripts".* FROM "android_scripts" WHERE "android_scripts"."id" = ? LIMIT 1  [["id", "1"]]

  def index
    if admin_signed_in?
      @android_scripts = AndroidScript.all
---
SELECT "android_scripts".* FROM "android_scripts"

  def edit
  	@android_script = AndroidScript.find(params[:id])
---
SELECT "android_scripts".* FROM "android_scripts" WHERE "android_scripts"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @android_script = AndroidScript.find(params[:id])
    if @android_script.update_attributes(android_scripts_params)
---
SELECT "android_scripts".* FROM "android_scripts" WHERE "android_scripts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "android_scripts" SET "script" = ?, "updated_at" = ? WHERE "android_scripts"."id" = 28  [["script", "Aetna_Student_Health___Waiver_Application_Confirmation.pdf"], ["updated_at", Fri, 02 May 2014 05:18:47 UTC +00:00]]

  def create
  	@android_script = AndroidScript.new(android_scripts_params)
  	if @android_script.save
---
INSERT INTO "android_scripts" ("created_at", "name", "script", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 25 Apr 2014 23:41:23 UTC +00:00], ["name", "Bob"], ["script", "blurb.png"], ["updated_at", Fri, 25 Apr 2014 23:41:23 UTC +00:00]]

  def destroy
    @android_script = AndroidScript.find(params[:id])
    @android_script.destroy
---
SELECT "android_scripts".* FROM "android_scripts" WHERE "android_scripts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "android_scripts" WHERE "android_scripts"."id" = ?  [["id", 1]]